quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
unsigned long fbNextAllowedAt = 0;
unsigned int fbFailStreak = 0;

void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak));
  if (backoff > 300000UL)
    backoff = 300000UL;
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);
  if (totalRecoveryAttempts >= cfg::MAX_RECOVERY_ATTEMPTS) {
    Serial.println("[Recovery] Max attempts — forcing reboot via WDT");
    delay(100);
    while (true) {
    }
  }
  modbus.recover();
  consecutiveReadFails = 0;
  Serial.println("[Recovery] RS485 bus re-initialized");
}

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    break;
  default:
    break;
  }
}

void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED)
    return;

  Serial.printf("[WiFi] Connecting to network: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] Connection failed — will retry later");
    WiFi.disconnect(true);
    delay(100);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  }
}

void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;
  fbConfig.database_url = FIREBASE_DB_URL;
  fbAuth.user.email = FIREBASE_USER_EMAIL;
  fbAuth.user.password = FIREBASE_USER_PASS;
  fbConfig.token_status_callback = tokenStatusCallback;
  fbData.setBSSLBufferSize(2048, 2048);
  Firebase.begin(&fbConfig, &fbAuth);
  Firebase.reconnectNetwork(true);
  Serial.println("[Firebase] init — authenticating");
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("\n========= Teerem IoT (S3-Zero) =========");

  led::begin();
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  modbus.begin();

  // SPM33 CT primary утгыг боотлох үед бүх 4 slave-ээс уншиж кэшилнэ — P
  // (40011) болон гүйдлийг secondary→primary хөрвүүлэхэд хэрэглэнэ. Унших нь
  // алдвал loop() cycle бүрт амжилттай болтол дахин оролдоно.
  delay(100);
  const uint8_t spmSlaves[4] = {cfg::EM01_SLAVE, cfg::EM02_SLAVE,
                                cfg::EM04_SLAVE, cfg::EM05_SLAVE};
  for (uint8_t s : spmSlaves) {
    Spm33_readCtPrimary(modbus, s);
    delay(cfg::FRAME_GAP_MS);
  }

  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle
  // (RS485 bus-ыг сенсорын уншилттай зэрэгцэхгүй).
  {
    static const uint8_t spmSlaves[4] = {cfg::EM01_SLAVE, cfg::EM02_SLAVE,
                                         cfg::EM04_SLAVE, cfg::EM05_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно, цаг хэмнэхийн тулд
      }
    }
  }

  // ── 1) Тэжээлийн жин (Slave 1) ────────────────────────────────────
  float flow = 0;
  bool flowOk = withRetry(
      [&] { return modbus.readFloat(cfg::SCALE_SLAVE, cfg::REG_FLOW, flow); });
  delay(cfg::FRAME_GAP_MS);

  double weightT = 0;
  bool weightOk = withRetry(
      [&] { return modbus.readDouble(cfg::SCALE_SLAVE, cfg::REG_WEIGHT_T, weightT); });
  delay(cfg::FRAME_GAP_MS);

  // ── 2) SPM33 цахилгаан тоолуурууд ─────────────────────────────────
  Spm33Reading em01 = Spm33_read(modbus, cfg::EM01_SLAVE, false);
  delay(cfg::FRAME_GAP_MS);
  Spm33Reading em02 = Spm33_read(modbus, cfg::EM02_SLAVE, false);
  delay(cfg::FRAME_GAP_MS);
  Spm33Reading em04 = Spm33_read(modbus, cfg::EM04_SLAVE, true);
  delay(cfg::FRAME_GAP_MS);
  Spm33Reading em05 = Spm33_read(modbus, cfg::EM05_SLAVE, true);
  delay(cfg::FRAME_GAP_MS);

  // ── 2b) Тээрмийн тэжээлийн ус (Slave 6) ───────────────────────────
  float feedFlow = 0, feedTotal = 0;
  bool feedFlowOk = withRetry(
      [&] { return modbus.readFloat(cfg::FLOW_SLAVE, cfg::FLOW_REG_RATE, feedFlow); });
  delay(cfg::FRAME_GAP_MS);
  bool feedTotalOk = withRetry(
      [&] { return modbus.readTotalizer(cfg::FLOW_SLAVE, cfg::FLOW_REG_TOTAL, feedTotal); });
  delay(cfg::FRAME_GAP_MS);

  // ── 2c) Эргэлтийн усан сан — Ultrasonic Level (Slave 7) ───────────
  // Register 0x2002 = Level instantaneous (uint16, decimal=3 → /1000 = m).
  uint16_t ulsRaw = 0;
  bool ulsLevelOk = withRetry(
      [&] { return modbus.readU16(cfg::ULS_SLAVE, cfg::REG_ULS_LEVEL, ulsRaw); });
  float ulsLevel = ulsLevelOk ? (ulsRaw / 1000.0f) : 0.0f;

  // ── 3) Уншилтын логийг товч ─────────────────────────────────────────
  Serial.printf("[Scale] flow:%s weight:%s\n",
                flowOk ? String(flow, 2).c_str() : "#",
                weightOk ? String(weightT, 3).c_str() : "#");
  auto logEm = [](const char *tag, const Spm33Reading &r, bool withI) {
    Serial.printf("[%s] P:%s E:%s", tag,
                  r.powerOk ? String(r.powerKW, 2).c_str() : "#",
                  r.energyOk ? String(r.energyKWh, 1).c_str() : "#");
    if (withI)
      Serial.printf(" Ia:%s Ib:%s Ic:%s",
                    r.currentsOk ? String(r.currentA, 2).c_str() : "#",
                    r.currentsOk ? String(r.currentB, 2).c_str() : "#",
                    r.currentsOk ? String(r.currentC, 2).c_str() : "#");
    Serial.println();
  };
  logEm("EM01", em01, false);
  logEm("EM02", em02, false);
  logEm("EM04", em04, true);
  logEm("EM05", em05, true);
  Serial.printf("[FeedWater] flow:%s total:%s\n",
                feedFlowOk ? String(feedFlow, 2).c_str() : "#",
                feedTotalOk ? String(feedTotal, 2).c_str() : "#");
  Serial.printf("[WaterTank] level:%s\n",
                ulsLevelOk ? String(ulsLevel, 3).c_str() : "#");

