quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
  // ── 4) Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = flowOk || weightOk || em01.powerOk || em01.energyOk ||
               em02.powerOk || em02.energyOk || em04.powerOk || em04.energyOk ||
               em04.currentsOk || em05.powerOk || em05.energyOk ||
               em05.currentsOk || feedFlowOk || feedTotalOk || ulsLevelOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── 5) Firebase upload — root("/") нэг update нь rules engine-д бүх 13+
  // замыг шалгуулж response timeout үүсгэдэг. Тиймээс /teerem ба
  // /energy_meters subtree-үүдийг тус тусад нь жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ Subtree 1: /teerem ──────────────────────────────────────────────
  bool teeremOk = true;
  bool teeremAny = false;
  {
    FirebaseJson j;
    if (flowOk) { j.set("weight_rate", flow); teeremAny = true; }
    if (weightOk) {
      j.set("cumulative_kg", (int)(weightT * 1000.0));
      teeremAny = true;
    }
    if (feedFlowOk) {
      j.set("feed_water/flow_rate", feedFlow);
      teeremAny = true;
    }
    if (feedTotalOk) {
      j.set("feed_water/totalizer", feedTotal);
      teeremAny = true;
    }
    if (ulsLevelOk) {
      j.set("water_tank/level", ulsLevel);
      teeremAny = true;
    }
    if (teeremAny) {
      j.set("last_updated", (int)(millis() / 1000));
      teeremOk = Firebase.RTDB.updateNodeSilent(&fbData, "/teerem", &j);
      if (!teeremOk)
        Serial.printf("[Firebase] /teerem ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ Subtree 2: /energy_meters ───────────────────────────────────────
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, bool withI) {
      String base = String(id) + "/";
      if (r.powerOk) { j.set((base + "power_kw").c_str(), r.powerKW); emAny = true; }
      if (r.energyOk) { j.set((base + "total_energy_kwh").c_str(), r.energyKWh); emAny = true; }
      if (withI && r.currentsOk) {
        j.set((base + "current_a").c_str(), r.currentA);
        j.set((base + "current_b").c_str(), r.currentB);
        j.set((base + "current_c").c_str(), r.currentC);
        emAny = true;
      }
    };
    addEm("em01", em01, false);
    addEm("em02", em02, false);
    addEm("em04", em04, true);
    addEm("em05", em05, true);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!teeremAny && !emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (teeremOk && emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, teeremOk && emOk);
}
